In [1]:
import pandas as pd

# Create a DataFrame using dictionary types
data = {
    'Product': ['Laptop', 'Tablet', 'Smartphone', 'Monitor', 'Keyboard'],
    'Price': [1000, 500, 800, 300, 100],
    'Stock': [50, 150, 200, 75, 300],
    'Rating': [4.5, 4.2, 4.8, 4.3, 4.0]
}

df_product = pd.DataFrame(data)
print(df_product)

      Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0

In [2]:
df_product

      Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0

In [4]:
df_product.size

20

In [5]:
df_product.shape

(5, 4)

In [10]:
df_product.size

20

In [15]:
df_product.tail

<bound method NDFrame.tail of       Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0>

In [16]:
df_product.head

<bound method NDFrame.head of       Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0>

In [17]:
df_product.product

<bound method DataFrame.prod of       Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0>

In [22]:
df_product.sum[

<bound method DataFrame.sum of       Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0>

In [24]:
df_product.mul

<bound method DataFrame.mul of       Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0>

In [26]:
 df_product.divide

<bound method DataFrame.truediv of       Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
1      Tablet    500    150     4.2
2  Smartphone    800    200     4.8
3     Monitor    300     75     4.3
4    Keyboard    100    300     4.0>

In [36]:
df_product[df_product["Price"]>500]

      Product  Price  Stock  Rating
0      Laptop   1000     50     4.5
2  Smartphone    800    200     4.8

In [38]:
df_product["Price"]

0    1000
1     500
2     800
3     300
4     100
Name: Price, dtype: int64

In [39]:
df_product["age"]=[2,4,3,1,6]

In [41]:
df_product

      Product  Price  Stock  Rating  age
0      Laptop   1000     50     4.5    2
1      Tablet    500    150     4.2    4
2  Smartphone    800    200     4.8    3
3     Monitor    300     75     4.3    1
4    Keyboard    100    300     4.0    6

In [42]:
import pandas as pd

data = {
    'Department': ['HR', 'IT', 'Finance', 'Marketing', 'Sales', 'IT', 'Finance', 'Marketing', 'Sales', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack'],
    'Salary': [50000, 60000, 55000, 65000, 62000, 58000, 54000, 62000, 63000, 52000],
    'Age': [24, 27, 22, 32, 29, 31, 28, 26, 30, 25]
}

In [43]:
df = pd.DataFrame(data)

In [44]:
df

  Department Employee  Salary  Age
0         HR    Alice   50000   24
1         IT      Bob   60000   27
2    Finance  Charlie   55000   22
3  Marketing    David   65000   32
4      Sales      Eve   62000   29
5         IT    Frank   58000   31
6    Finance    Grace   54000   28
7  Marketing   Hannah   62000   26
8      Sales      Ivy   63000   30
9         HR     Jack   52000   25

In [45]:
print("Original DataFrame:\n", df)

Original DataFrame:
   Department Employee  Salary  Age
0         HR    Alice   50000   24
1         IT      Bob   60000   27
2    Finance  Charlie   55000   22
3  Marketing    David   65000   32
4      Sales      Eve   62000   29
5         IT    Frank   58000   31
6    Finance    Grace   54000   28
7  Marketing   Hannah   62000   26
8      Sales      Ivy   63000   30
9         HR     Jack   52000   25

In [46]:
# Group by Department and calculate the mean salary and mean age
grouped = df.groupby('Department').agg({'Salary': 'mean', 'Age': 'mean'})

In [47]:
grouped

             Salary   Age
Department
Finance     54500.0  25.0
HR          51000.0  24.5
IT          59000.0  29.0
Marketing   63500.0  29.0
Sales       62500.0  29.5

In [48]:
print("Grouped and Aggregated DataFrame:\n", grouped)

Grouped and Aggregated DataFrame:
              Salary   Age
Department
Finance     54500.0  25.0
HR          51000.0  24.5
IT          59000.0  29.0
Marketing   63500.0  29.0
Sales       62500.0  29.5

In [49]:
data2 = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack'],
    'Years_of_Experience': [2, 5, 3, 6, 4, 7, 5, 6, 8, 2]
}

df2 = pd.DataFrame(data2)
print("Second DataFrame:\n", df2)

Second DataFrame:
   Employee  Years_of_Experience
0    Alice                    2
1      Bob                    5
2  Charlie                    3
3    David                    6
4      Eve                    4
5    Frank                    7
6    Grace                    5
7   Hannah                    6
8      Ivy                    8
9     Jack                    2

In [50]:
# Merge the two DataFrames on the 'Employee' column
merged_df = pd.merge(df, df2, on='Employee')
print("Merged DataFrame:\n", merged_df)

Merged DataFrame:
   Department Employee  Salary  Age  Years_of_Experience
0         HR    Alice   50000   24                    2
1         IT      Bob   60000   27                    5
2    Finance  Charlie   55000   22                    3
3  Marketing    David   65000   32                    6
4      Sales      Eve   62000   29                    4
5         IT    Frank   58000   31                    7
6    Finance    Grace   54000   28                    5
7  Marketing   Hannah   62000   26                    6
8      Sales      Ivy   63000   30                    8
9         HR     Jack   52000   25                    2